import { Accordion, AccordionContent, AccordionPanel, AccordionTitle } from "flowbite-react";
import HeaderLibrary from "../../components/HeaderLibrary";
import AccordionPanelCompo from "../../components/AccordionPanelCompo";
import CheckActivationCompo from "../../components/CheckActivationCompo";

export default function Ayat_E_Shifa(){
     
    const ayatEShifa=[
        { arabicText:'وَيَشْفِ صُدُورَ قَوْمٍ مُؤْمِنِينَ', banglaText:'ওয়া ইয়াশফি ছুদু-রা ক্বাওমিম মু’মিনি-ন', meaning:'এবং আল্লাহ মু’মিনদের (মুসলমানদের) অন্তরসমূহ শান্ত করে দেন' },
        { arabicText:'وَشِفَاءٌ لِمَا فِي الصُّدُورِ وَهُدًى وَرَحْمَةٌ لِلْمُؤْمِنِينَ', banglaText:'ওয়া শিফাউ’ল লিমা- ফিচ্ছুদু-রি ওয়া হুদাও ওয়া রাহমাতুল লিল মু’মিনি-ন', meaning:'এবং অন্তরের রোগের নিরাময়, হেদায়েত ও রহমত মুসলমানদের জন্য' },
        { arabicText:'يَخْرُجُ مِنْ بُطُونِهَا شَرَابٌ مُخْتَلِفٌ أَلْوَانُهُ فِيهِ شِفَاءٌ لِلنَّاسِ', banglaText:'ইয়াখরুঝু মিমবুতু-নিহা- শারা-বুম মুখতালিফুন, আলওয়ানুহু- ফি-হি শিফা-উ লিন্না-সি', meaning:'তার পেট থেকে বিভিন্ন রঙে পানীয় নির্গত হয়'},
        { arabicText:'وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِلْمُؤْمِنِينَ', banglaText:'ওয়া নুনাজ্জিলু মিনাল ক্বুরআ’নি মা হুয়া শিফাউও ওয়া রাহমাতুল লিলমু’মিনি-ন', meaning:'আমি কুরআনে এমন বিষয় নাযিল করি যা রোগের সুচিকিৎসা এবং মুমিনের জন্য রহমত'},
        { arabicText:'وَإِذَا مَرِضْتُ فَهُوَ يَشْفِيْنِ', banglaText:'ওয়া ইজা মারিদতু ফা হুয়া ইয়াশফি-নি', meaning:'এবং যখন আমি রোগাক্রান্ত হই, তখন তিনিই আরোগ্য দান করেন'},
        { arabicText:'قُلْ هُوَ لِلَّذِيْنَ آمَنُوْا هُدًى وَّشِفَاءٌ', banglaText:'কুল হুওয়া লিল্লাযীনা আ-মানূ হুদাওঁ ওয়া শিফাউন', meaning:'বলুন, এটা বিশ্বাসীদের জন্য হেদায়েত ও রোগের প্রতিকার' }

    ]


    return(
        <> 
            <HeaderLibrary/> 
            <CheckActivationCompo>
                <div className="p-4">
                    <Accordion collapseAll>
                        <AccordionPanel>
                            <AccordionPanelCompo title={'রোগ মুক্তির ৬ টি আয়াত'} itemsArray={ayatEShifa} />
                        </AccordionPanel>
                        <AccordionPanel>
                            <AccordionPanelCompo 
                                title={'দুরূদে শিফা'} 
                                arabicText={'اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ بِعَدَدِ كُلِّ دَاءٍ وَدَوَاءٍ ، وَبِعَدَدِ كُلِّ عِلَّةٍ وَشِفَاءٍ'}
                                banglaText={'আল্লাহুম্মা ছাল্লি আলা সায়্যিদিনা মুহাম্মাদিম বি আদাদি কুল্লি দা-ইও ওয়া দাওয়া. ওয়া বি আদাদি কুল্লি ইল্লাতিও ওয়া শিফা।'}
                                meaning={'হে আল্লাহ! আপনি আমাদের সায়্যিদ হযরত মুহাম্মদ ﷺ-এর উপর সকল রোগ ও রোগমুক্তির উপকরণ এর সংখ্যানুপাতে সালাত পেশ করুন।'}
                            />                        
                        </AccordionPanel>                                        
                        <AccordionPanel>
                            <AccordionPanelCompo 
                                title={'কঠিন রোগমুক্তির দু‘আ'} 
                                arabicText={'رَبِّ اَنِّـىْ مَـسَّـنِـىَ الـضُّـرُّ وَاَنْـتَ اَرْحَـمُ الـرّٰحِـمِـيْـنَ'} 
                                banglaText={'রাব্বি আন্নী মাস্সানিয়াদ-দুর্রু ওয়া আনতা আরহামুর-রাহিমীন।'}
                                meaning={'আমি দুঃখ-কষ্টে পড়েছি, তুমিতো সর্বশ্রেষ্ঠ দয়ালু।'}
                            />                        

                        </AccordionPanel>
                        <AccordionPanel>
                            <AccordionPanelCompo 
                                title={'শারীরিক কঠিন ব্যথা দূর করার দু‘আ'} 
                                arabicText={'أَعُوذُ بِعِزَّةِ اللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ'}
                                banglaText={'আউযু বি-ইজ্জাতিল্লাহি ওয়া কুদরাতিহী মিন শাররি মা আজিদু ওয়া উহাযিরু'}
                                meaning={'আল্লাহর নামে আমি আল্লাহর অসীম সম্মান ও তাঁর বিশাল ক্ষমতার উসীলায় আমার অনুভূত এই ব্যথার ক্ষতি থেকে আশ্রয় প্রার্থনা করি'}
                                description={'আমলের নিয়ম: শরীরের ব্যথার স্থানে ডান হাত রেখে প্রথমে ৩ বার বিসমিল্লাহ বলবেন, তারপর এই দোয়াটি ৭ বার পড়ে ব্যথার জায়গায় ফুঁ দেবেন বা হাত বুলাবেন।'}
                            />                        
                        </AccordionPanel>                        
                        <AccordionPanel>
                            <AccordionPanelCompo 
                                title={'জ্বর হলে এ দু‘আ পড়বে'} 
                                arabicText={'بِسْمِ اللّٰهِ الْكَبِيْرِ اَعُوْذُ بِاللّٰهِ الْعَظِيْمِ مِنْ شَرِّ كُلِّ عِرْقٍ نَّعَّارٍ وَمِنْ شَرِّ حَرِّ النَّارِ'} 
                                banglaText={'বিসমিল্লাহিল কাবীরি আ‘ঊযুবিল্লা হিল ‘আযীমি মিন শাররি কুল্লি ‘ইরক্বিন না‘আা রিন ওয়া মিন শাররি হার রিন্নার।'}
                                meaning={'মহান আল্লাহর নামের সাথে আমি মহান আল্লাহ তা‘আলার আশ্রয় গ্রহণ করছি প্রত্যেক উত্তেজিত ধমনীর অনিষ্ট থেকে এবং দোযখের উত্তাপের অনিষ্ট থেকে।'}
                            />
                        </AccordionPanel>
                        <AccordionPanel>
                            <AccordionPanelCompo 
                                title={'শ্বেত ও কুষ্ঠরোগ এবং মহামারী থেকে পানাহ চাওয়ার দু‘আ'} 
                                arabicText={'اَللّٰهُمَّ اِنِّىْ اَعُوْذُ بِكَ مِنَ الْبَرَصِ وَ الْجُنُوْنِ وَ الْجُذَامِ وَمِنْ سَىِّءِ الْاَسْقَامِ'}
                                banglaText={'আল্লহুম্মা ইন্নি আউযুবিকা মিনাল বারাসি ওয়াল জুনুনি ওয়াল জুযামি ওয়া মিন ছাইয়্যি ইল আসক্বম।'}
                                meaning={'হে আল্লাহ! আমি তোমার কাছে আশ্রয় চাই শ্বেতকুষ্ঠ উন্মাদনা, কুষ্ঠরোগ এবং সমস্ত খারাপ রোগ থেকে।'}
                            />                        
                        </AccordionPanel>
                                                
                    </Accordion>   
                </div>                
            </CheckActivationCompo>                   
        </>
    )
}