import { Accordion, AccordionContent, AccordionPanel, AccordionTitle } from "flowbite-react";
import HeaderLibrary from "../../components/HeaderLibrary";
import AccordionPanelCompo from "../../components/AccordionPanelCompo";
import CheckActivationCompo from "../../components/CheckActivationCompo";

export default function RizqDua(){
     
    return(
        <> 
            <HeaderLibrary/> 
            <CheckActivationCompo>
                <div className="p-4">
                    <Accordion>
                        <AccordionPanel>
                            <AccordionPanelCompo 
                                title={'রিজিক লাভের দোয়া'} 
                                arabicText={'اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَرَحْمَتِكَ ، فَإِنَّهُ لاَ يَمْلِكُهَا إِلاَّ أَنْتَ'}
                                banglaText={'আল্লাহুম্মা ইন্নি আসআলুকা মিন ফাদলিকা ওয়া রহমাতিকা, ফাইন্নাহু লা ইয়ামলিকুহা ইল্লা আনতা।'}
                                meaning={'হে আল্লাহ! আমি আপনার কাছে আপনার অনুগ্রহ (ফজল) এবং রহমত প্রার্থনা করছি; কারণ আপনি ব্যতীত অন্য কেউ এর মালিক নয়।'}
                                description={'এটি সহিহ সনদে বর্ণিত একটি অত্যন্ত বরকতপূর্ণ দোয়া। আবদুল্লাহ ইবনে মাসউদ (রা.) থেকে বর্ণিত, একবার রাসুলুল্লাহ ﷺ-এর কাছে মেহমান এলে ঘরে কোনো খাবার ছিল না। তখন তিনি এই দোয়াটি পাঠ করেন। কিছুক্ষণের মধ্যেই তাঁকে ভুনা বকরির গোশত হাদিয়া দেওয়া হয়। তখন তিনি বললেন: "আল্লাহ আমাদের তাঁর ফজল ও রহমত দান করেছেন, আর বাকীটা (আখেরাতের নেয়ামত) আমাদের জন্য গচ্ছিত রেখেছেন।" '}
                            />                        
                        </AccordionPanel>

                        <AccordionPanel>
                            <AccordionPanelCompo 
                                title={'রিযিক বৃদ্ধির দোয়া'} 
                                arabicText={'اللَّهُمَّ اغْفِرْ لِي ذَنْبِي ، وَوَسِّعْ لِي فِي رِزْقِي ، وَبَارِكْ لِي فِيمَا رَزَقْتَنِي'}
                                banglaText={'আল্লাহুম্মাগফির লি জাম্বি, ওয়া ওয়াসসি লি ফি রিযকি, ওয়া বারিক লি ফিমা রাজাকতানি।'}
                                meaning={'হে আল্লাহ, আমার গুনাহ ক্ষমা করে দিন, আমার ঘর প্রশস্ত করে দিন এবং আপনি আমাকে যে জীবিকা দান করেছেন তাতে বরকত দান করুন।'}
                                description={'আবু হুরায়রা (রা.) থেকে বর্ণিত, এক ব্যক্তি নবীজি (সা.)-কে রাতে উল্লিখিত দোয়া পাঠ করতে শোনেন। (সুনানে তিরমিজি, হাদিস : ৩৫০০)'}
                            />                        
                        </AccordionPanel>

                        <AccordionPanel>
                            <AccordionPanelCompo 
                                title={'দুনিয়া ও আখেরাতের সর্বাত্তম কল্যাণের দোয়া'} 
                                arabicText={'رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ'}
                                banglaText={'রাব্বানা আতিনা ফিদ্দুনিয়া হাসানাতাঁও ওয়া ফিল আখিরাতি হাসানাতাঁও ওয়া কিনা আজাবান নার।'}
                                meaning={'হে আমাদের রব! আমাদের দুনিয়াতে কল্যাণ দান করুন এবং আখেরাতেও কল্যাণ দান করুন, আর আমাদেরকে জাহান্নামের আজাব থেকে রক্ষা করুন।'}
                                description={'এটি সর্বশ্রেষ্ঠ ও সবচেয়ে বেশি পঠিত দোয়াগুলোর একটি। রাসুলুল্লাহ (সা.) সবচেয়ে বেশি এই দোয়াটি পাঠ করতেন। (সহিহ বুখারি, হাদিস : ৪৫২২)'}
                            />                        
                        </AccordionPanel> 

                        <AccordionPanel>
                            <AccordionPanelCompo 
                                title={'দুনিয়া ও আখেরাতের সর্বাত্তম কল্যাণের দোয়া'} 
                                arabicText={'مَا شَاءَ اللَّهُ لَا قُوَّةَ إِلَّا بِاللَّهِ ۚ'}
                                banglaText={'মা-শা-আল্লাহু লা কুওয়াতা ইল্লা বিল্লাহ।'}
                                meaning={'আল্লাহ যা চেয়েছেন (তাই হয়েছে), আল্লাহ ছাড়া কোনো ক্ষমতা বা শক্তি নেই।'}
                                description={'নিজের কোনো অর্জন, সন্তান বা সম্পদ দেখে নজর লাগা বা অহংকার থেকে বাঁচার জন্য এই বাক্যটি পাঠ করা অত্যন্ত ফজিলতপূর্ণ। (সুরা আল-কাহফ, আয়াত : ৩৯)'}
                            />                        
                        </AccordionPanel>                                                
                    </Accordion>   
                </div>                
            </CheckActivationCompo>                   
        </>
    )
}